org/posts/2016-01-01-so-2016-much-beam-very-polyglot.org
#+options: toc:nil
#+begin_export html
---
title:  "So 2016. Much BEAM. Very polyglot."
author: Eric Bailey
tags: lfe, lisp, elixir, beam, polyglot
updated: 18 December, 2023
---
#+end_export

This is why I love [[https://lfe.io][Lisp Flavoured Erlang]].

#+caption: [[https://github.com/yurrriq/blorg/blob/main/code/so-2016.lfe][so-2016.lfe]]
#+begin_src lfe :tangle ../../hakyll/code/so-2016.lfe
(progn
  (include-lib "clj/include/compose.lfe") ; Clojure threading macros
  (-> (lodox-parse:docs #"lodox")         ; lodox docs map, generated by lodox
      (mref 'modules)                     ; lodox modules (Maclisp)
      (cadddr)                            ; 4th module =:= lodox-parse (CL)
      (mref 'exports)                     ; lodox-parse exports (Maclisp)
      (hd)                                ; first function =:= docs/1 (Erlang)
      (mref 'doc)                         ; docstring of docs/1
      (list_to_binary)                    ; string->binary
      (Elixir.Markdown:to_html            ; Elixir app wrapping C lib
       '[#(fenced_code true)])))          ; as in GitHub Flavored Markdown
#+end_src

Gott nytt år! {{{marginnote(https://en.wiktionary.org/wiki/gott_nytt_%C3%A5r)}}}

* References
- [[https://github.com/lfe/lfe/blob/develop/include/clj.lfe][clj: Clojure functions and macros for LFE]]
- [[https://github.com/lfe-rebar3/lodox][Lodox: Like Codox for LFE]]
- [[http://www.maclisp.info/pitmanual/index.html][The Revised Maclisp Manual]]
- [[https://lfe-rebar3.github.io/lodox/lodox-parse.html#export-docs.2F1][lodox-parse:docs/1]]
- [[http://learnyousomeerlang.com/starting-out-for-real#lists][Learn You Some Erlang: Lists!]]
- [[https://github.com/devinus/markdown][Markdown: A simple Elixir Markdown to HTML conversion library]]
- [[https://github.com/hoedown/hoedown][Hoedown: Standard C99 Markdown parser]]
- [[https://help.github.com/articles/github-flavored-markdown/#fenced-code-blocks][GitHub Flavored Markdown: Fenced code blocks]]
