_posts/2016-01-01-so-2016-much-beam-very-polyglot.html
---
layout: post
title:  "So 2016. Much BEAM. Very polyglot."
date:   Thu 2016-01-01 02:42:42 CDT
---

<pre>
<p>
(→ This (is (why (→ I (love <a href="http://lfe.io/">Lisp Flavoured Erlang</a>)))))
</p>
</pre>

<div class="org-src-container">

<pre class="src src-lfe"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">progn</span>
  <span style="color: #66D9EF;">(</span>include-lib <span style="color: #E6DB74;">"clj/include/compose.lfe"</span><span style="color: #66D9EF;">)</span> <span style="color: #75715E;">; Clojure threading macros</span>
  <span style="color: #66D9EF;">(</span>-&gt; <span style="color: #A6E22E;">(</span>lodox-parse:docs #<span style="color: #E6DB74;">"lodox"</span><span style="color: #A6E22E;">)</span>         <span style="color: #75715E;">; lodox docs map, generated by lodox</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">mref</span> 'modules<span style="color: #A6E22E;">)</span>                     <span style="color: #75715E;">; lodox modules (Maclisp)</span>
      <span style="color: #A6E22E;">(</span>cadddr<span style="color: #A6E22E;">)</span>                            <span style="color: #75715E;">; 4th module =:= lodox-parse (CL)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">mref</span> 'exports<span style="color: #A6E22E;">)</span>                     <span style="color: #75715E;">; lodox-parse exports (Maclisp)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">hd</span><span style="color: #A6E22E;">)</span>                                <span style="color: #75715E;">; first function =:= docs/1 (Erlang)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">mref</span> 'doc<span style="color: #A6E22E;">)</span>                         <span style="color: #75715E;">; docstring of docs/1</span>
      <span style="color: #A6E22E;">(</span>list_to_binary<span style="color: #A6E22E;">)</span>                    <span style="color: #75715E;">; string-&gt;binary</span>
      <span style="color: #A6E22E;">(</span>Elixir.Markdown:to_html            <span style="color: #75715E;">; Elixir app wrapping C lib</span>
       '<span style="color: #E6DB74;">[</span>#<span style="color: #FD971F;">(</span>fenced_code true<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">]</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>          <span style="color: #75715E;">; as in GitHub Flavored Markdown</span>
</pre>
</div>

<p>
Gott nytt år!
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">References</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li><a href="https://github.com/lfex/clj#future-">clj: Clojure functions and macros for LFE</a></li>
<li><a href="https://github.com/quasiquoting/lodox">Lodox: Like Codox for LFE</a></li>
<li><a href="http://www.maclisp.info/pitmanual/index.html">The Revised Maclisp Manual</a></li>
<li><a href="http://quasiquoting.org/lodox/lodox-parse.html#func-docs.2F1">lodox-parse:docs/1</a></li>
<li><a href="http://learnyousomeerlang.com/starting-out-for-real#lists">Learn You Some Erlang: Lists!</a></li>
<li><a href="https://github.com/devinus/markdown">Markdown: A simple Elixir Markdown to HTML conversion library</a></li>
<li><a href="https://github.com/hoedown/hoedown">Hoedown: Standard C99 Markdown parser</a></li>
<li><a href="https://help.github.com/articles/github-flavored-markdown/#fenced-code-blocks">GitHub Flavored Markdown: Fenced code blocks</a></li>
</ul>
</div>
</div>
